app/controllers/followers_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "follows".* FROM "follows" WHERE "follows"."user_id" = ? AND "follows"."following_id" = ?  [["user_id", 1], ["following_id", 4]]
INSERT INTO "follows" ("user_id", "following_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["following_id", 4], ["created_at", "2020-02-19 12:35:09.097139"], ["updated_at", "2020-02-19 12:35:09.097139"]]
---
  def follow
    if params[:following_id].blank?
      render json: {success: false, code: "404", message: 'User required to follow'}
      return
    end
    following_user = User.find_by_id(params[:following_id])
    if following_user.blank?
      render json: {success: true, code: "200", message: 'A vaild user to follow'}
      return
    end
    follow = Follow.where(user_id: current_user.id, following_id: params[:following_id])
    if follow.blank?
      Follow.create(user_id: current_user.id, following_id: params[:following_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "follows".* FROM "follows" WHERE "follows"."user_id" = ? AND "follows"."following_id" = ?  [["user_id", 1], ["following_id", 4]]
DELETE FROM "follows" WHERE "follows"."id" = ?  [["id", 8]]
---
  def unfollow
    if params[:unfollow_id].blank?
      render json: {success: false, code: "404", message: 'User required to un follow!'}
      return
    end
    user = User.find_by_id(params[:unfollow_id])
    if user.blank?
      render json: {success: false, code: "404", message: 'Please proivde valid user to Unfollow'}
      return
    end
    follow = Follow.where(user_id: current_user.id, following_id: params[:unfollow_id])
    if follow.blank?
      render json: {success: false, code: "404", message: "You do not follow this user"}
    else
      follow.destroy_all