app/controllers/tweets_controller.rb

SELECT "follows"."following_id" FROM "follows" WHERE "follows"."user_id" = ?  [["user_id", 1]]
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" IN (?, ?, ?) ORDER BY created_at DESC  [["user_id", 2], ["user_id", 3], ["user_id", 4]]
---
  def index
    followers_ids = Follow.where(user_id: current_user.id).pluck(:following_id)
    if params[:tweet][:order] == 'desc'
      @tweets = Tweet.where(user_id: followers_ids).order("created_at DESC")

INSERT INTO "tweets" ("message", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["message", "My Third tweet shesh"], ["user_id", 1], ["created_at", "2020-02-22 08:45:04.991627"], ["updated_at", "2020-02-22 08:45:04.991627"]]
---
  def create
    if params[:tweet][:message].blank?
      render json: {success: false, code: 400, message: 'Please proivde valid parameters'}
      return
    end
    tweet = current_user.tweets.create(message: params[:tweet][:message])