app/controllers/users_controller.rb

  def profile
    following_ids = Follow.where(user_id: current_user.id).pluck(:following_id)
    @following = User.where(id: following_ids)
    follower_ids = Follow.where(following_id: current_user.id).pluck(:user_id)
---
SELECT "follows"."following_id" FROM "follows" WHERE "follows"."user_id" = ?  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "follows"."user_id" FROM "follows" WHERE "follows"."following_id" = ?  [["following_id", 1]]